<a href="https://colab.research.google.com/github/imdasrj98/Employee-Churn-Prediction/blob/master/Pre_Process.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [2]:
dataset1 = pd.read_excel("/content/drive/My Drive/DataAnalyticsProblem.xlsx", sheet_name = "Employees who have left")
dataset1["left"] = 1
dataset2 = pd.read_excel("/content/drive/My Drive/DataAnalyticsProblem.xlsx", sheet_name = "Existing employees")
dataset2["left"] = 0
dataset = pd.concat([dataset1, dataset2])

In [3]:
dataset.head()

   Emp ID  satisfaction_level  last_evaluation  ...   dept  salary  left
0       1                0.38             0.53  ...  sales     low     1
1       2                0.80             0.86  ...  sales  medium     1
2       3                0.11             0.88  ...  sales  medium     1
3       4                0.72             0.87  ...  sales     low     1
4       5                0.37             0.52  ...  sales     low     1

[5 rows x 11 columns]

In [4]:
dataset.shape

(14999, 11)

In [5]:
dataset.isnull().sum()

Emp ID                   0
satisfaction_level       0
last_evaluation          0
number_project           0
average_montly_hours     0
time_spend_company       0
Work_accident            0
promotion_last_5years    0
dept                     0
salary                   0
left                     0
dtype: int64

In [6]:
from sklearn import preprocessing
l = preprocessing.LabelEncoder()
dataset['dept'] = l.fit_transform(dataset['dept'])
dataset['salary'] = l.fit_transform(dataset['salary'])

In [7]:
dataset.head()

   Emp ID  satisfaction_level  last_evaluation  ...  dept  salary  left
0       1                0.38             0.53  ...     7       1     1
1       2                0.80             0.86  ...     7       2     1
2       3                0.11             0.88  ...     7       2     1
3       4                0.72             0.87  ...     7       1     1
4       5                0.37             0.52  ...     7       1     1

[5 rows x 11 columns]

In [8]:
dataset.to_csv('/content/drive/My Drive/final_data_employee_churn.csv')